"""
此代码用于将校正图像中的点(x1,y1)转换为透射投影后的世界坐标点(x2,y2)
"""

import numpy as np

# 透射变换矩阵

# D2
H = np.array([[8.96006877e-01,  2.31916020e+00, -8.51326377e+02],
              [-5.12414468e-01, 4.65595720e+00, -6.64092910e+01],
              [-8.59537155e-05,  2.21599522e-03,  1.00000000e+00]])
"""

# D3
H = np.array( [[-1.03787705e+00,  1.88670687e+00,  1.03010487e+03],
 [-4.18113744e-01, -1.58264043e-01,  2.51505809e+03],
 [-2.36097600e-04,  1.91716677e-03, 1.00000000e+00]])
"""

# 校正后图像中的点坐标 (x1, y1)
# x1 = 856  --> x2 = 400
# y1 = 316  --> y2 = 600
x1 = 782
y1 = 393

# 转换为齐次坐标
point_homogeneous = np.array([[x1], [y1], [1]])

# 应用透射变换矩阵
transformed_point = np.dot(H, point_homogeneous)

# 获取真实坐标 (x2, y2)
x2 = transformed_point[0, 0] / transformed_point[2, 0]
y2 = transformed_point[1, 0] / transformed_point[2, 0]

# 输出真实坐标
print("校正图像中的点 ({}, {}) 对应的真实坐标为 ({}, {})".format(x1, y1, x2, y2))
